<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Python_Data_Analytics_Course/blob/main/4_Problems/2_04_Pandas Pivot Tables.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

In [22]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

## ðŸŸ© Count Job Postings by Title and Country (2.4.1)

In [23]:
pivot = df.pivot_table(index=['job_title_short', 'job_country'], aggfunc='size').head(10).copy()

---

## ðŸŸ¨ Salary Stats by Job Title (2.4.2)

In [24]:
pivot_table = df.pivot_table(values='salary_year_avg', index='company_name', aggfunc=['max', 'min', 'mean']).copy()
pivot_table.head(5)

                                    max             min            mean
                        salary_year_avg salary_year_avg salary_year_avg
company_name
#twiceasnice Recruiting   120000.000000    61000.000000    77750.000000
/dev/color                125000.000000   125000.000000   125000.000000
0nward Select              92500.000000    92500.000000    92500.000000
1 Point System            137290.484375   137290.484375   137290.484375
1 Point System LLC.       170000.000000   170000.000000   170000.000000

---

## ðŸŸ¥ Sum Salary by Title and Country (2.4.3)

In [29]:
df_filtered = df.loc['Data Scientist' == df['job_title_short']].copy()
pivot_table = df_filtered.pivot_table(values='salary_year_avg', index=['company_name', 'job_country'], aggfunc='median')
pivot_table = pivot_table[pivot_table['salary_year_avg'] > 200000]
pivot_table.head(10)

                                   salary_year_avg
company_name        job_country
ACT                 Sudan                 225000.0
                    United States         225000.0
Abbott              United States         204000.0
Airbnb              United States         212500.0
Airtable            Sudan                 215500.0
                    United States         233500.0
Algo Capital Group  Sudan                 325000.0
                    United States         350000.0
Amadeus Search      United States         232500.0
Analog Devices, Inc United States         375000.0

---